{
	"navbar": {
		"english": "Englisch",
		"french": "Französisch",
		"german": "Deutsch",
		"about": "Über",
		"skills": "Fähigkeiten",
		"projects": "Projekte",
		"blog": "Blog",
		"contact": "Kontakt",
		"language": "Sprache"
	},
	"heroSection": {
		"description": "<span class='text-gray-100'>Webentwickler und Technik-Enthusiast.</span> Interessiert an allem, was mit dem Web, Netzwerken und der Technikwelt zu tun hat."
	},
	"aboutSection": {
		"title": "Über mich",
		"intro": "Hallo, ich bin Chakib Ouzane (auch bekannt als <span class='italic font-sans'>ch33kaboo</span>), ein 22-jähriger Informatikstudent im letzten Jahr aus Algerien. Als Full-Stack-Webentwickler habe ich eine Leidenschaft für den Aufbau effizienter, skalierbarer Backendsysteme und intuitiver, reaktionsschneller Frontend-Erfahrungen (en: responsive), um nahtlose Full-Stack-Lösungen zu schaffen.",
		"portfolio": "Mein Portfolio zeigt eine Reihe von Projekten, die meine Fähigkeiten und meine Begeisterung für die Entwicklung widerspiegeln.",
		"goals": "Ich erkunde ständig neue Technologien und arbeite an Projekten, die mich herausfordern, zu wachsen. Mein Ziel ist es, zu innovativen Projekten beizutragen, die die Grenzen der Webentwicklung erweitern.",
		"additionalInterests": "Neben der Webentwicklung interessiere ich mich auch für Netzwerke und IoT, und ich hatte die Gelegenheit, diese Technologien in Universitätslaboren zu testen.",
		"CV": "Lebenslauf"
	},
	"skillsSection": {
		"title": "Fähigkeiten & Expertise",
		"languages": "Programmiersprachen",
		"databases": "Datenbanken",
		"toolsOther": "Werkzeuge & Sonstiges",
		"itSystems": "IT-Systeme",
		"networking": "Netzwerke"
	},
	"projectsSection": {
		"title": "Projekte",
		"project1": {
			"projectTitle": "de projectTitle",
			"description": "de description",
			"keyFeatures": "de keyFeatures",
			"techStack": "de techStack"
		}
	},
	"contactSection": {
		"title": "Kontakt aufnehmen",
		"description": "Ich bin immer offen für neue Projekte, kreative Ideen oder die Möglichkeit, Teil Ihrer Visionen zu sein. Zögern Sie nicht, mich zu kontaktieren!"
	}
}
