{
	"navbar": {
		"english": "Englisch",
		"french": "Französisch",
		"german": "Deutsch",
		"about": "Über",
		"skills": "Fähigkeiten",
		"projects": "Projekte",
		"blog": "Blog",
		"contact": "Kontakt",
		"language": "Sprache"
	},
	"heroSection": {
		"description": "<span class='text-gray-100'>Webentwickler und Technik-Enthusiast.</span> Interessiert an allem, was mit dem Web, Netzwerken und der Technikwelt zu tun hat."
	},
	"aboutSection": {
		"title": "Über mich",
		"intro": "Hallo, ich bin Chakib Ouzane (auch bekannt als <span class='italic font-sans'>ch33kaboo</span>), ein 22-jähriger Informatikstudent im letzten Jahr aus Algerien. Als Full-Stack-Webentwickler habe ich eine Leidenschaft für den Aufbau effizienter, skalierbarer Backendsysteme und intuitiver, reaktionsschneller Frontend-Erfahrungen (en: responsive), um nahtlose Full-Stack-Lösungen zu schaffen.",
		"portfolio": "Mein Portfolio zeigt eine Reihe von Projekten, die meine Fähigkeiten und meine Begeisterung für die Entwicklung widerspiegeln.",
		"goals": "Ich erkunde ständig neue Technologien und arbeite an Projekten, die mich herausfordern, zu wachsen. Mein Ziel ist es, zu innovativen Projekten beizutragen, die die Grenzen der Webentwicklung erweitern.",
		"additionalInterests": "Neben der Webentwicklung interessiere ich mich auch für Netzwerke und IoT, und ich hatte die Gelegenheit, diese Technologien in Universitätslaboren zu testen.",
		"CV": "Lebenslauf"
	},
	"skillsSection": {
		"title": "Fähigkeiten & Expertise",
		"languages": "Programmiersprachen",
		"databases": "Datenbanken",
		"toolsOther": "Werkzeuge & Sonstiges",
		"itSystems": "IT-Systeme",
		"networking": "Netzwerke"
	},
	"projectsSection": {
		"title": "Projekte und Beiträge",
		"description": "Hier sind Projekte, an denen ich gearbeitet habe, sowie einige kleine Beiträge, die ich zu Open-Source-Projekten geleistet habe.",
		"card": {
			"description": "Beschreibung",
			"keyFeatures": "Hauptmerkmale",
			"sourceCode": "Quellcode",
			"liveDemo": "Live-Demo"
		},
		"projectsContent": {
			"project1": {
				"projectTitle": "Alphabit Club Community Website",
				"description": "Ich habe eine Website für die AlphaBit-Club-Community entwickelt, auf der Besucher die neuesten Veranstaltungen, Partner, den Blog, die Podcasts und weitere Informationen des Clubs einsehen können.",
				"keyFeatures": "Der Inhalt der Website ist dynamisch, da er im Markdown-Format in <a href='https://github.com/ch33kaboo/alphabit-CMS-test' target='_blank' class='link'>diesem GitHub Repository<a/> geschrieben ist. Jedes Mal, wenn ein Besucher auf eine Seite zugreift, ruft die Website den entsprechenden Inhalt aus dem Repository ab, konvertiert die Markdown-Dateien in HTML und rendert sie für den Client. Darüber hinaus ist die Website responsiv und bietet einen Dark Mode."
			},
			"project2": {
				"projectTitle": "Innovium",
				"description": "Eine Webanwendung, die den gesamten Prozess der Bewerbung für ein Startup oder ein Patent für ein Abschlussprojekt digitalisieren soll. Dies war mein interdisziplinäres Universitätsprojekt im 3. Jahr meines Informatikstudiums. Innovium war ein Gruppenprojekt, an dem ich und drei meiner Freunde beteiligt waren. Weitere Informationen über das Projekt finden Sie <a class='link' target='_blank' href='https://web.archive.org/web/20241201103659/https://miloudi.dev/innovium'>hier</a>.",
				"keyFeatures": "Ermöglichen Sie Studierenden, Projektvorschläge einzureichen. Geben Sie dem wissenschaftlichen Ausschuss der Universität die Möglichkeit, Vorschläge zu prüfen und anzunehmen oder abzulehnen. Stellen Sie Projektbetreuern Werkzeuge zur Verfügung, um Aufgaben den Projektmitgliedern zuzuweisen und nachzuverfolgen. Statten Sie den Praktikumsdienst mit der Fähigkeit aus, Projektverteidigungen zu organisieren und zu planen. Ermöglichen Sie dem Praktikumsdienst, den Vorsitzenden, die Mitglieder und die Gäste der Verteidigung zu benennen, neben weiteren Funktionen. Weitere Details finden Sie <a class='link' target='_blank' href='https://web.archive.org/web/20241201103659/https://miloudi.dev/innovium'>hier</a>."
			},
			"project3": {
				"projectTitle": "AlphaBit Website",
				"description": "Gemeinsam mit dem Alphabit-Entwicklungsteam habe ich die offizielle Website des Alphabit-Clubs entwickelt. Das Hauptziel der Website war es, die Veranstaltungen des Clubs zu präsentieren, um neue Sponsoren zu gewinnen und die Aktivitäten des Clubs zu finanzieren. Aus Gründen der Vertraulichkeit und Sicherheit kann der Quellcode nicht öffentlich zugänglich gemacht werden.",
				"keyFeatures": ""
			},
			"project4": {
				"projectTitle": "Obsidian Soundscapes",
				"description": "Ich habe zu einem open source Projekt namens obsidian-soundscapes beigetragen, einem Obsidian-Plugin, das es dem Benutzer ermöglicht, Musik zu spielen, während er in Obsidian arbeitet. Die Funktion, die ich implementiert habe, fügt dem Musikplayer Wiedergabebefehle hinzu, mit denen die Musik abgespielt oder pausiert und zum nächsten oder vorherigen Titel mit Obsidian-Befehlen gewechselt werden kann.",
				"keyFeatures": ""
			},
			"project5": {
				"projectTitle": "Sodea Website",
				"description": "Während meines Praktikums im Sommer 2023 habe ich an der Entwicklung der Website für Sodea, ein Unternehmen von <a href='https://www.groupe-hasnaoui.com' target='_blank' class='link'>GSH “Groupe des Sociétés HASNAOUI”<a/>, gearbeitet. Aufgrund von Zeitbeschränkungen, da mein Praktikum endete, bevor ich die Website fertigstellen konnte, habe ich das Projekt, einschließlich des Codes und aller zugehörigen Materialien, an einen Entwickler im Unternehmen übergeben. Dieser baute auf meiner Arbeit auf und setzte die Entwicklung der Website fort.",
				"keyFeatures": "Dynamische Inhaltsintegration mit Sanity CMS, Echtzeit-Updates über die Sanity-API, intuitive Administrationsoberfläche zur Produktverwaltung, responsives Design, einfach erweiterbar mit zusätzlichen Funktionen."
			},
			"project6": {
				"projectTitle": "Erstellung von Hackathon-Herausforderungen",
				"description": "Ich habe als Herausgeber von Herausforderungen für die Veranstaltung “AlphaBit-coding-challenge-4.0” beigetragen, einen Hackathon, der organisiert wurde, um Studierende und Begeisterte für kompetitive Programmierung zusammenzubringen. Als einer der sechs Herausgeber war ich verantwortlich für die Gestaltung spannender und anspruchsvoller Programmieraufgaben, um die Problemlösungsfähigkeiten und Kreativität der Teilnehmenden zu testen.",
				"keyFeatures": "Der Fokus lag nicht nur darauf, die Probleme korrekt zu lösen, sondern auch auf der Codekomplexität und der Ausführungszeit."
			},
			"project7": {
				"projectTitle": "ESI Hub",
				"description": "de description",
				"keyFeatures": "de keyFeatures"
			},
			"project8": {
				"projectTitle": "Jeunesse Volontaire Website",
				"description": "de description",
				"keyFeatures": "de keyFeatures"
			},
			"project9": {
				"projectTitle": "SvelteKit Starter",
				"description": "de description",
				"keyFeatures": "de keyFeatures"
			},
			"project10": {
				"projectTitle": "Chronos",
				"description": "de description",
				"keyFeatures": "de keyFeatures"
			},
			"project11": {
				"projectTitle": "Travel Tip",
				"description": "de description",
				"keyFeatures": "de keyFeatures"
			},
			"project12": {
				"projectTitle": "No Push Main",
				"description": "de description",
				"keyFeatures": "de keyFeatures"
			},
			"project13": {
				"projectTitle": "Cool Chat Box",
				"description": "de description",
				"keyFeatures": "de keyFeatures"
			},
			"project14": {
				"projectTitle": "To Do app",
				"description": "de description",
				"keyFeatures": "de keyFeatures"
			},
			"project15": {
				"projectTitle": "Roboterauto",
				"description": "de description",
				"keyFeatures": "de keyFeatures"
			}
		}
	},
	"blogSection": {
		"title": "Blog",
		"description": "Ich bin ein großer Fan von <a href='https://obsidian.md/' class='link' target='_blank'>Obsidian<a/> und schreibe regelmäßig über verschiedene Themen in mein Obsidian-Vault. Einige Artikel sind technologiebezogen, andere nicht.<br>Nach dem Hochladen werden sie auf <a target='_blank' class='link' href='https://blog.chakib.tech'>blog.chakib.tech</a> verfügbar sein."
	},
	"contactSection": {
		"title": "Kontakt aufnehmen",
		"description": "Ich bin immer offen für neue Projekte, kreative Ideen oder die Möglichkeit, Teil Ihrer Visionen zu sein. Zögern Sie nicht, mich zu kontaktieren!"
	}
}
