{
	"navbar": {
		"english": "English",
		"french": "French",
		"german": "German",
		"about": "About",
		"skills": "Skills",
		"projects": "Projects",
		"blog": "Blog",
		"contact": "Contact",
		"language": "language"
	},
	"heroSection": {
		"description": "<span class='text-gray-100'>Web Developer, and Tech Enthusiast.</span> Interested in everything related to the Web, Networking & the tech world."
	},
	"aboutSection": {
		"title": "About Me",
		"intro": "Hi, I'm Chakib Ouzane (aka <span class='italic font-sans'>ch33kaboo</span>), a 22-year-old final-year Computer Science student from Algeria. As a full-stack web developer, I have a passion for building efficient, scalable backend systems alongside their intuitive, responsive frontend experiences to create seamless full-stack solutions.",
		"portfolio": "My portfolio showcases a range of projects that reflect my skills and enthusiasm for development.",
		"goals": "I'm continuously exploring new technologies and working on projects that challenge me to grow. My goal is to contribute to innovative projects that push the boundaries of web development.",
		"additionalInterests": "Alongside web development, I’m also interested in networking and IoT, and I’ve had the opportunity to experiment with these technologies in university labs.",
		"CV": "Resume"
	},
	"skillsSection": {
		"title": "Skills & Expertise",
		"languages": "Languages",
		"databases": "Databases",
		"toolsOther": "Tools & Other",
		"itSystems": "IT Systems",
		"networking": "Networking"
	},
	"projectsSection": {
		"title": "Projects and Contributions",
		"description": "Here are projects that I worked on, also some small contributions that I made to open-source projects.",
		"card": {
			"description": "Description",
			"keyFeatures": "Key Features",
			"sourceCode": "Source Code",
			"liveDemo": "Live Demo"
		},
		"projectsContent": {
			"project1": {
				"projectTitle": "Alphabit Club Community Website",
				"description": "I developed a website for the AlphaBit Club community, where visitors can explore the club's recent events, partners, blog, podcasts, and other additional information.",
				"keyFeatures": "The website's content is dynamic, as it is written in Markdown format in <a href='https://github.com/ch33kaboo/alphabit-CMS-test' target='_blank' class='link'>this GitHub repository<a/>. Whenever a visitor enters a page, the website fetches the corresponding content from the repository, parses the Markdown files to HTML, and renders them for the client. Additionally, the website is responsive and supports dark mode."
			},
			"project2": {
				"projectTitle": "Innovium",
				"description": "A web application designed to digitalize the entire process of applying for a startup or a patent for an end-of-study project. This was my 3rd-year CS multidisciplinary university project. Innovium was a group project involving me and three of my friends. Further information about the project can be found <a class='link' target='_blank' href='https://web.archive.org/web/20241201103659/https://miloudi.dev/innovium'>here</a>.",
				"keyFeatures": "Allow students to submit project proposals. Enable the university’s scientific committee to review and accept or reject proposals. Provide project supervisors with tools to assign and track tasks for project members. Equip the internship service with the ability to organize and schedule project defenses. Allow the internship service to assign the jury president, members, and invitees for project defenses, among other features. Further details can be found <a class='link' target='_blank' href='https://web.archive.org/web/20241201103659/https://miloudi.dev/innovium'>here</a>."
			},
			"project3": {
				"projectTitle": "AlphaBit Website",
				"description": "I, along with the Alphabit dev team, developed the official website for the Alphabit Club. The primary goal of the website was to showcase the club's events to attract new sponsors and secure funding for its activities. For confidentiality and security reasons, the source code cannot be disclosed publicly.",
				"keyFeatures": ""
			},
			"project4": {
				"projectTitle": "Obsidian Soundscapes",
				"description": "I contributed to an open source project named obsidian-soundscapes, which is an Obsidian plugin that allows users to play music while using Obsidian. The feature I implemented adds playback commands to the music player, enabling users to play or pause the music and navigate to the next or previous track using Obsidian commands.",
				"keyFeatures": ""
			},
			"project5": {
				"projectTitle": "Sodea Website",
				"description": "During my internship in the summer of 2023, I worked on building the website for Sodea, a company owned by <a href='https://www.groupe-hasnaoui.com' target='_blank' class='link'>GSH “Groupe des Sociétés HASNAOUI”<a/>. Due to time constraints, as my internship period ended while I was still working on the website, I handed over the project, including the code and all related materials, to a developer within the company. They built upon my work and continued the website's development.",
				"keyFeatures": "Dynamic content integration with Sanity CMS, real-time updates via Sanity API, intuitive admin interface for managing products, responsive design, easy to extend with additional features."
			},
			"project6": {
				"projectTitle": "Authoring Hackathon Challenges",
				"description": "I contributed as a challenges author for the event “AlphaBit-coding-challenge-4.0”, a hackathon organized to bring together students and enthusiasts passionate about competitive programming. As one of the six challenge authors, I was responsible for designing engaging and thought-provoking coding challenges to test the participants' problem-solving skills and creativity.",
				"keyFeatures": "Focus was not only on solving the problems correctly, but also on code complexity and execution time."
			},
			"project7": {
				"projectTitle": "ESI Hub",
				"description": "en description",
				"keyFeatures": "en keyFeatures"
			},
			"project8": {
				"projectTitle": "Jeunesse Volontaire Website",
				"description": "en description",
				"keyFeatures": "en keyFeatures"
			},
			"project9": {
				"projectTitle": "SvelteKit Starter",
				"description": "en description",
				"keyFeatures": "en keyFeatures"
			},
			"project10": {
				"projectTitle": "Chronos",
				"description": "en description",
				"keyFeatures": "en keyFeatures"
			},
			"project11": {
				"projectTitle": "Travel Tip",
				"description": "en description",
				"keyFeatures": "en keyFeatures"
			},
			"project12": {
				"projectTitle": "No Push Main",
				"description": "en description",
				"keyFeatures": "en keyFeatures"
			},
			"project13": {
				"projectTitle": "Cool Chat Box",
				"description": "en description",
				"keyFeatures": "en keyFeatures"
			},
			"project14": {
				"projectTitle": "To Do app",
				"description": "en description",
				"keyFeatures": "en keyFeatures"
			},
			"project15": {
				"projectTitle": "Robot Car",
				"description": "en description",
				"keyFeatures": "en keyFeatures"
			}
		}
	},
	"blogSection": {
		"title": "Blog",
		"description": "I’m a huge fan of <a href='https://obsidian.md/' class='link' target='_blank'>Obsidian<a/> and frequently write about various topics in my Obsidian vault. Some articles are tech-related, some others are not.<br>Once uploaded, they will be available at <a target='_blank' class='link' href='https://blog.chakib.tech'>blog.chakib.tech<a/>."
	},
	"contactSection": {
		"title": "Get in Touch",
		"description": "I'm always open to discussing new projects, creative ideas, or opportunities to be part of your visions. Feel free to reach out!"
	}
}
